Revit 2027 API
ExportColorMode Enumeration
 An enumerated type listing export color mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ExportColorMode
Public Enumeration ExportColorMode
public enum class ExportColorMode
type ExportColorMode
Members
Member name | Value | Description
IndexColors | 0 |  All colors from the Revit project will be set to the closest of the 255 AutoCAD Color Index colors.
TrueColor | 1 |  All colors from the Revit project will be exported as 24-bit RGB values as specified in object styles.
TrueColorPerView | 2 |  All colors from the Revit project will be exported as 24-bit RGB values as specified in view.
See Also
Reference
Autodesk.Revit.DB Namespace